cask_args appdir: '/Applications'

tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'jhawthorn/fzy'
tap 'neovim/neovim'
tap 'socratessystems/socrates'

## CLI

brew 'git'
brew 'libgit2'
brew 'the_silver_searcher'
brew 'postgresql'
brew 'mysql'
brew 'redis'
brew 'hub'
brew 'vim'
brew 'neovim'
brew 'ctags'
brew 'tmux'
brew 'htop'
brew 'reattach-to-user-namespace'
brew 'go'
brew 'fortune'
brew 'sl' # Corrects bad typing
brew 'tree'
brew 'yadm'
brew 'mas'
brew 'git-crypt'
brew 'zplug'
brew 'fzy'
brew 'fzf'
brew 'fswatch'
brew 'socratessystems/socrates/unison'
brew 'nmap'
brew 'diff-so-fancy'
brew 'asdf'

## PHP

brew 'php'

## Node

brew 'node'
brew 'yarn'

## Applications

cask 'google-chrome'
cask 'firefox'
cask 'cloudapp'
cask 'iterm2'
cask 'spectacle'
cask 'dash'
cask 'gpg-suite'
cask 'virtualbox'
cask 'vagrant'
cask 'hipchat'
cask 'sequel-pro-nightly'
cask 'postico'
cask 'docker'
cask 'cyberduck'
cask 'postman'
cask 'steam'
cask 'bbedit'
cask 'jetbrains-toolbox'
cask 'visual-studio-code'
cask 'spotify'
cask 'spotify-notifications'
cask 'stride'

## Fonts

cask 'font-menlo-for-powerline'
cask 'font-monoid-nerd-font'
